components/ExportToPdf.php

SELECT * FROM `organization`
---
	public function exportData($title='',$filename='Edusec Pdf',$html=NULL)
	{
		$mpdf = new mPDF(['utf-8', 'A4',0,'',15,15,25,16,4,9,'P']);
		$org = Organization::find()->asArray()->one();