models/User.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `users` WHERE `user_id`=33

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);
---
SELECT * FROM `users` WHERE `user_id`=18

    public static function findByUsername($username)
    {
        return static::findOne(['user_login_id' => $username]);
---
SELECT * FROM `users` WHERE `user_login_id`='student'